# s = "Тел. №88005553535 Проще позвонить, чем у кого-то занимать"
# m = s[6:17]
# print(m)
# print(m[::-1])

# ____________________________________________________________________________________________________________________________________

# s = input("Введите строку для разворота: ")
# print(s[::-1])

# ____________________________________________________________________________________________________________________________________

# s = "Анна"
# m = s[::-1]
# print(s)
# print(m)
# print(s.lower() == m.lower())

# ____________________________________________________________________________________________________________________________________

user_name = "Виктор"
user_age = 54
user_height = 188

print("Кандидат на должность директора: \nИмя: " + user_name +"\nВозраст:  "+ str(user_age) +"\nРост: " + str(user_height))
print(f"Кандидат на должность директора: \nИмя: {user_name} \nВозраст: {user_age} \nРост: {user_height}")